Terraform plan for __production__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-eks-gsa-datagov-development"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "eab3d327-7d9f-423b-9838-753c26fdb5a0"
      + url                              = "https://ssb-eks-gsa-datagov-management.app.cloud.gov"
      + username                         = "dcfeafe9-d732-a0c5-ced9-667c250075ff"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-datagov-development"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "eab3d327-7d9f-423b-9838-753c26fdb5a0"
      + url                              = "https://ssb-smtp-gsa-datagov-management.app.cloud.gov"
      + username                         = "6df193d1-834d-ae10-0aaa-3b358fc38306"
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-solr-gsa-datagov-development"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "eab3d327-7d9f-423b-9838-753c26fdb5a0"
      + url                              = "https://ssb-solr-gsa-datagov-management.app.cloud.gov"
      + username                         = "a9c3a3ed-82cc-59d3-d7fa-9893870a2f87"
    }

  # module.broker_solrcloud.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-solrcloud-gsa-datagov-development"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "eab3d327-7d9f-423b-9838-753c26fdb5a0"
      + url                              = "https://ssb-solrcloud-gsa-datagov-management.app.cloud.gov"
      + username                         = "7044f05b-9fd6-53c0-81c3-98860e70893e"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ client_spaces = [
      + "gsa-datagov/development",
        "gsa-datagov/management",
        # (2 unchanged elements hidden)
    ]
```
</details>

:memo: Plan generated in [plan #140](https://github.com/GSA/datagov-ssb/actions/runs/1814086201)